tutorials/heatTransfer/buoyantSimpleFoam/simpleCarSolarPanel/Allrun
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

restore0Dir

mkdir -p constant/triSurface

cp -f $FOAM_TUTORIALS/resources/geometry/simpleCar.stl.gz constant/triSurface

runApplication blockMesh

runApplication surfaceFeatureExtract

runApplication snappyHexMesh -overwrite

runApplication $(getApplication)

#------------------------------------------------------------------------------
